### Author: Uday Routhu

### Books (Core)

### Imports

In [28]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pandas as pd

In [29]:
username = "root"
password = "root" # (whatever password you chose during mysql installation)
db_name = "books"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [30]:
#Create engine
engine = create_engine(connection_str)

In [32]:
#Create database
create_database(connection_str)

In [33]:
#To verify that the database was created
database_exists(connection_str)

True

### Part 1: Design an ERD

![png](input/Design_Erd_Books.png)

### Part 2: Create the database in Python

In [44]:
df = pd.read_csv('input/users.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [45]:
df.to_sql('users', engine, if_exists = 'replace')

3

In [46]:
q = """SELECT * FROM users LIMIT 5;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [34]:
df = pd.read_csv('input/books.csv')
df.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [35]:
df.to_sql('books', engine, if_exists = 'replace')

6

In [36]:
q = """SELECT * FROM books LIMIT 5;"""
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4

In [37]:
df = pd.read_csv('input/authors.csv')
df.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [38]:
df.to_sql('authors', engine, if_exists = 'replace')

5

In [39]:
q = """SELECT * FROM authors LIMIT 5;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

In [40]:
df = pd.read_csv('input/favorites.csv')
df.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [41]:
df.to_sql('favorites', engine, if_exists = 'replace')

7

In [42]:
q = """SELECT * FROM favorites LIMIT 5;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5

### Testing the Database

In [47]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1